Revit 2024 API
ExporterIFC.FileVersion Property
 Identifies the file version being exported.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public IFCVersion FileVersion { get; }
Visual Basic
Public ReadOnly Property FileVersion As IFCVersion
	Get
Visual C++
public:
property IFCVersion FileVersion {
	IFCVersion get ();
}
See Also
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace